# Intro to Dataframes

In [ ]:
import pandas as pd 

df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], columns=["A", "B", "C"], index=["x", "y", "z"])
# You can specify the columns and indexes as shown above

In [15]:
# To see the first 5 rows
df.head()

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [16]:
# To see the last 5 rows
df.tail()

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [17]:
# To acsess columns
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [18]:
# To acsess indexes
df.index.to_list()

['x', 'y', 'z']

In [ ]:
# To get information about the dataframe
df.info()
"""
The output describes a pandas DataFrame with 3 rows (indexed x to z) and 3 columns (A, B, and C). 
All columns contain integer (int64) values with no missing data, and the entire DataFrame uses 
about 96 bytes of memory.
"""

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [20]:
# To get summary statistical information about the data
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [ ]:
# To find how many unique values are in each column
df.nunique()
# For specific column you can use df["A"].nunique()

A    3
B    3
C    3
dtype: int64

In [ ]:
# To know the shape of the dataframe (row x column)
df.shape

(3, 3)

In [23]:
# To know the number of items in the Dataframe
df.size

9

# Loading in Dataframes from Files

In [24]:
weather = pd.read_csv('data/weather.csv')

weather.head()

   Unnamed: 0   data        date           param     siteid
0           1   0.00  2003-01-01   Precipitation       ACRE
1           2   0.00  2003-01-02   Precipitation  AlbertLea
2           3  11.32  2003-01-03   Precipitation       Ames
3           4   0.00  2003-01-04   Precipitation     Antigo
4           5   3.04  2003-01-05   Precipitation   Appleton

# Accessing Data with Pandas

In [28]:
# To get full summary of the data
# You can also access the first 10 (x) rows by weather.head(x)
weather

        Unnamed: 0   data        date                 param      siteid
0                1   0.00  2003-01-01         Precipitation        ACRE
1                2   0.00  2003-01-02         Precipitation   AlbertLea
2                3  11.32  2003-01-03         Precipitation        Ames
3                4   0.00  2003-01-04         Precipitation      Antigo
4                5   3.04  2003-01-05         Precipitation    Appleton
...            ...    ...         ...                   ...         ...
655357      655358  -1.96  2015-12-28   Minimum temperature       SEPAC
655358      655359  -3.86  2015-12-29   Minimum temperature     Seymour
655359      655360  -4.50  2015-12-30   Minimum temperature  Sutherland
655360      655361  -5.22  2015-12-31   Minimum temperature      Urbana
655361      655362  -8.23  2016-01-01   Minimum temperature    Walworth

[655362 rows x 5 columns]

In [29]:
# To access random data
weather.sample(10)

        Unnamed: 0       data        date                 param        siteid
635317      635318  -2.540000  2013-02-17   Maximum temperature        Dekalb
286586      286587   0.000000  2007-07-05         Precipitation     Bean&Beet
132946      132947   0.000000  2015-12-07         Precipitation     Bean&Beet
335440      335441   7.210000  2011-03-30   Maximum temperature    Brownstown
57605        57606   0.000000  2004-09-09         Precipitation          DPAC
498040      498041   8.190000  2014-05-07   Minimum temperature        Urbana
342344      342345   0.000000  2004-02-21         Precipitation  DixonSprings
347849      347850   8.390000  2006-03-18   Maximum temperature    Sutherland
121880      121881  31.540001  2011-08-22   Maximum temperature      Monmouth
76173        76174        NaN  2003-07-09   Maximum temperature    Sutherland

In [ ]:
# To acess specific values using loc & iloc
# loc allows you to filter by rows and columns ie. weather.loc[[rows], [columns]]
weather.loc[[1,2,10], ["Unnamed: 0", "param"]]

    Unnamed: 0   data        date           param     siteid
1            2   0.00  2003-01-02   Precipitation  AlbertLea
2            3  11.32  2003-01-03   Precipitation       Ames
10          11   0.00  2003-01-11   Precipitation  Crookston